---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MEPNetworkSegmentId Constructor
MEPNetworkSegmentId Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | MEPNetworkSegmentId()()()() | Creates a default invalid segment id on the network. |
|  | MEPNetworkSegmentId(ElementId, Int32) | Creates a valid segment id on the network. |

# See Also

MEPNetworkSegmentId Class

MEPNetworkSegmentId Members

Autodesk.Revit.DB.Analysis Namespace